// Напишите программу, котрая принимает на вход цифру, образющую день недели 
//и проверяет является ли этот день выходным


Console.WriteLine("Введите номер дня недели: ");
int n = int.Parse(Console.ReadLine()!);

if(n == 1) Console.WriteLine("нет");   
if(n == 2) Console.WriteLine("нет");  
if(n == 3) Console.WriteLine("нет");   
if(n == 4) Console.WriteLine("нет");
if(n == 5) Console.WriteLine("нет");   
if(n == 6) Console.WriteLine("да");
if(n == 7) Console.WriteLine("да"); 


